array.sort()
// الدالة sort() تُستخدم لترتيب عناصر المصفوفة.
// sort() تغيّر المصفوفة الأصلية (ليست نسخة).

//! 🔹 مشكلة sort() بدون دالة مقارنة
const numbers = [10, 2, 5, 1];
numbers.sort();

console.log(numbers);
// [1, 10, 2, 5] ❌

// ❓ لماذا؟
// لأن JavaScript ترتّب كنصوص (Strings) وليس كأرقام.
// يعني:
// "10" comes before "2"
// because "1" smaler than "2"

// ✅ الحل الصحيح: دالة المقارنة
numbers.sort((a, b) => a - b);

//! 🔹 كيف تعمل (a, b) => a - b؟
// في كل مقارنة:
// a = العنصر الأول
// b = العنصر الثاني
// a before b = رقم سالب
// b before a = رقم موجب

// 🧠 مثال عملي
[5, 2].sort((a, b) => a - b);
// a = 5
// b = 2
// 5 - 2 = 3 -> (موجب)
// النتيجة: [2, 5]
////////////////////////////////////////////////////
//! 🔹 ترتيب تصاعدي (من الأصغر للأكبر)
arr.sort((a, b) => a - b);
// مثال:
[19, 5, 42, 2].sort((a, b) => a - b);
// [2, 5, 19, 42]

//! 🔹 ترتيب تنازلي (من الأكبر للأصغر)
arr.sort((a, b) => b - a);
// مثال:
[19, 5, 42, 2].sort((a, b) => b - a);
// [42, 19, 5, 2]
////////////////////////////////////////////////////
//! 🔹 ترتيب نصوص
const names = ["banana", "apple", "cherry"];
names.sort();

console.log(names);
// ["apple", "banana", "cherry"]
/////////////////////////////////////////////////////
//! 🔹 لماذا استخدمنا [...] قبل sort()؟
const sorted = [...arr].sort((a, b) => a - b);
// ✔️ لأن sort() تغيّر المصفوفة الأصلية
// ✔️ [...] تنسخ المصفوفة قبل الترتيب